# DataFrame Attributes :

1. `loc[ ]` :

### Key Concepts :

- `loc attribute`: one of the primary ways to select data from a DataFrame. It is label-based, which means you have to specify the name of the rows or columns to select data. loc is label-based.
  
- `boolean mask`: a series of True/False values used to filter or select elements from another data structure, such as a list, array, or DataFrame, based on a certain condition.
- `Intuition`
The consider a students DataFrame has three columns:
student_id (type: int) - a unique identifier for the student.
name (type: object, which is generally a string in pandas) - the student's name.
age (type: int) - the student's age.
In this problem, we must create a function that accepts a DataFrame as an argument and returns a DataFrame with the required information.

we will use the loc function to select the row where student_id is 101 and return the value from the name and age columns.
To do this, we must provide loc with two arguments.

```python
students.loc[students['student_id'] == 101, ['name', 'age']]
```

2.`head()` :

- `head method` :
-  a method provided by the pandas library that is used on a DataFrame to return the first n rows. If n is omitted, it defaults to returning the first 5 rows. This is useful to get an overview or quick look at the beginning of large datasets.

- `Intuition` :
Let's explore step by step how to return the first 3 rows of a DataFrame.
- `Importing pandas` :
 
```python
python import pandas as pd
```
This line imports the pandas library and gives it an alias name pd. The pandas library provides fast, flexible, and expressive data structures designed to work with structured (tabular, multidimensional, potentially heterogeneous)Â data.

### DataFrame :
| employee_id | name       | department             | salary |
|-------------|------------|------------------------|--------|
| 3           | Bob        | Operations             | 48675  |
| 90          | Alice      | Sales                  | 11096  |
| 9           | Tatiana    | Engineering            | 33805  |
| 60          | Annabelle  | Information Technology | 37678  |
| 49          | Jonathan   | Human Resources        | 23793  |
| 43          | Khaled     | Administration         |        |

- We return the employees DataFrame using the the head function with an input of 3, to indicate we want to return the first 3 rows:
```python

print(employees.head(3))

```
# Output : 
| employee_id | name    | department  | salary |
|-------------|---------|-------------|--------|
| 3           | Bob     | Operations  | 48675  |
| 90          | Alice   | Sales       | 11096  |
| 9           | Tatiana | Engineering | 33805  |

## head() Method :

In [1]:
import pandas as pd
# Importing pandas library using 'Import' Keyord

In [2]:
employee_data = [
    {"employee_id": 3, "name": "Bob", "department": "Operations", "salary": 48675},
    {"employee_id": 90, "name": "Alice", "department": "Sales", "salary": 11096},
    {"employee_id": 9, "name": "Tatiana", "department": "Engineering", "salary": 33805},
    {"employee_id": 60, "name": "Annabelle", "department": "Information Technology", "salary": 37678},
    {"employee_id": 49, "name": "Jonathan", "department": "Human Resources", "salary": 23793},
    {"employee_id": 43, "name": "Khaled", "department": "Administration", "salary": None}
]
# Define the employee data as a list of dictionaries

In [3]:
# Convert the list of dictionaries to a pandas DataFrame
employee_df = pd.DataFrame(employee_data)

In [4]:
employee_df

   employee_id       name              department   salary
0            3        Bob              Operations  48675.0
1           90      Alice                   Sales  11096.0
2            9    Tatiana             Engineering  33805.0
3           60  Annabelle  Information Technology  37678.0
4           49   Jonathan         Human Resources  23793.0
5           43     Khaled          Administration      NaN

In [5]:
employee_df.head(3)
# this Will return first three columns and rows in a DataFrames

   employee_id     name   department   salary
0            3      Bob   Operations  48675.0
1           90    Alice        Sales  11096.0
2            9  Tatiana  Engineering  33805.0

# loc[ ] Method :

### For our convinence we are creating a new DataFrame you can try with same Dataframe
Here we are creating studenyyt data consisting their Name ,Student ID and Age.

In [7]:
student_data = [
    {"student_id": 101, "name": "Ulysses", "age": 13},
    {"student_id": 53, "name": "William", "age": 10},
    {"student_id": 128, "name": "Henry", "age": 6},
    {"student_id": 3, "name": "Henry", "age": 11}
]
# Define the student data as a list of dictionaries

In [8]:
# Creating DataFrame Form Given Data
student_df=pd.DataFrame(student_data)# passing Nested List as Parameter.

In [9]:
student_df

   student_id     name  age
0         101  Ulysses   13
1          53  William   10
2         128    Henry    6
3           3    Henry   11

In [11]:
# Select Data Using loc[ ] method 
student_df.loc[student_df['student_id'] == 101, ['name', 'age']]

      name  age
0  Ulysses   13

## This is How you can Select data in DataFrame using head() and loc[] methods